In [1]:
#pandasをインポート(pandasはpdという名前で使用する)
import pandas as pd

# データフレームについて
#+半角で文字を大きくすることが可能

In [53]:
#二次元リストを使った作成方法
#データの中身、カラム名（列の名前、一番上に書く）、インデックス名（行の名前,一番左に書く）の順に記述する
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                  columns=['col01','col02','col03'],
                  index=['idx01','idx02','idx03'])
#dfって書くだけでデータフレームが見れる
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [54]:
#Numpy(高速にリストを計算するためのライブラリ)をインポートし、npという名前をつける
import numpy as np

In [55]:
df = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),
                  columns=['col01','col02','col03'],
                  index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [56]:
#indexの値を取得
df.index

Index(['idx01', 'idx02', 'idx03'], dtype='object')

In [57]:
#カラムの値を取得
df.columns

Index(['col01', 'col02', 'col03'], dtype='object')

In [58]:
#辞書型
df = pd.DataFrame({'col01':[1,2,3],
                   'col02':[4,5,6],
                   'col03':[7,8,9],})
df

   col01  col02  col03
0      1      4      7
1      2      5      8
2      3      6      9

In [59]:
#辞書型のindex名の設定
df = pd.DataFrame({'col01':[1,2,3],
                   'col02':[4,5,6],
                   'col03':[7,8,9],})
df.index=['ind01','idx02','idx03']
df

       col01  col02  col03
ind01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [60]:
#辞書型で最初からindex名を記述する方法
df = pd.DataFrame({'col01':[1,2,3],
                   'col02':[4,5,6],
                   'col03':[7,8,9],}
                 ,index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      4      7
idx02      2      5      8
idx03      3      6      9

In [61]:
#カラム、インデックスの操作
df = pd.DataFrame([[1,2,3],
                   [4,5,6],
                   [7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [62]:
df.columns=['col01','col02','col03']
df.index=['idx01','idx02','idx03']

In [63]:
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [64]:
#カラムの変更
df.columns=['col04','col05','col06']

In [65]:
df

       col04  col05  col06
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [66]:
#カラム名の変更
df = df.rename(columns={'col04':'x'})
df

       x  col05  col06
idx01  1      2      3
idx02  4      5      6
idx03  7      8      9

In [67]:
df = df.rename(columns={'col05':'y','col06':'z'})
df

       x  y  z
idx01  1  2  3
idx02  4  5  6
idx03  7  8  9

In [68]:
df = df.rename(index={'idx01':'w'})
df

       x  y  z
w      1  2  3
idx02  4  5  6
idx03  7  8  9

In [69]:
#データから1列取り出す
df['x']

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [70]:
#形式をデータフレームとしてデータを取得
df[['x']]

       x
w      1
idx02  4
idx03  7

In [71]:
#確認
type(df[['x']])

pandas.core.frame.DataFrame

In [72]:
df.loc['w']

x    1
y    2
z    3
Name: w, dtype: int64

In [73]:
df.loc['idx02']

x    4
y    5
z    6
Name: idx02, dtype: int64

In [74]:
#行、列の順番でデータを取得
df.loc['idx02','x']

np.int64(4)

In [75]:
#xの列を全て取得
df.loc[: ,'x']

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [76]:
#0番目の列番号の情報を取得
df.iloc[: ,0]

w        1
idx02    4
idx03    7
Name: x, dtype: int64

In [77]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                  columns=['cdl01','col02','col03'],
                  index=['idx01','idx02','idx03'])
df

       cdl01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [78]:
df.loc['idx03','col02']

np.int64(8)

In [79]:
#上のデータを書き換える
df.loc['idx03','col02']=100
df

       cdl01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7    100      9

In [80]:
df.loc[:,'col03']=['Tokyo','Osaka','Hokkaido']
df

/var/folders/m1/jcwwylfj5z7d_zdkcry0_4r40000gn/T/ipykernel_1893/1023523706.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '['Tokyo', 'Osaka', 'Hokkaido']' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[:,'col03']=['Tokyo','Osaka','Hokkaido']

       cdl01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7    100  Hokkaido

In [81]:
#複数行取得
df.loc[:,'col02':'col03']
df

       cdl01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7    100  Hokkaido

In [82]:
df.iloc[:,1:3]

       col02     col03
idx01      2     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [83]:
#行番号を取得
df.index.get_loc('idx03')

2

In [84]:
#列番号を取得
df.columns.get_loc('col02')

1

In [85]:
#行番号と列番号を取得してデータを変更
df.iloc[df.index.get_loc('idx03'),df.columns.get_loc('col02')]=1000
df

       cdl01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7   1000  Hokkaido

In [86]:
#列ごとのデータ型を調べる
df.dtypes

cdl01     int64
col02     int64
col03    object
dtype: object

In [87]:
#行数と列数を取得
df.shape

(3, 3)

In [88]:
#行と列の入れ替え
df.T

       idx01  idx02     idx03
cdl01      1      4         7
col02      2      5      1000
col03  Tokyo  Osaka  Hokkaido